<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,20,3" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>20</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_3344" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3" offset="0" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_3339" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="12" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_3336" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="1036" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_3331" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="3084" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_3328" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="4108" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_3249" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="6156" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_2585" type="Const" version="opset1">
			<data element_type="f32" shape="256, 3" offset="7180" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/model/encoders/fc1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/fc1/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/model/encoders/fc1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/fc1/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_3263" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="10252" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_3250" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="11276" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Transpose_2592" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 256" offset="15372" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/model/encoders/layers.0/self_attn/wq/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/model/encoders/layers.0/self_attn/wq/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/linear/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_145" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/model/encoders/layers.0/self_attn/wq/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/norm/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_3251" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="1063956" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model/encoders/layers.0/self_attn/wq/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/norm/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_3252" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="1068052" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/model/encoders/layers.0/self_attn/wq/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/model/encoders/layers.0/self_attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1072148" size="32" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model/encoders/layers.0/self_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_163" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1072180" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/model/encoders/layers.0/self_attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_3253" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="1072212" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Transpose_2608" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 256" offset="1076308" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/model/encoders/layers.0/self_attn/wk/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model/encoders/layers.0/self_attn/wk/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/linear/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_167" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/model/encoders/layers.0/self_attn/wk/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/norm/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_3254" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="2124884" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model/encoders/layers.0/self_attn/wk/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/norm/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_3255" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="2128980" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/model/encoders/layers.0/self_attn/wk/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model/encoders/layers.0/self_attn/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1072148" size="32" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/model/encoders/layers.0/self_attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_200" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2133076" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/model/encoders/layers.0/self_attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_2_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_3256" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2133108" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Multiply_3188" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model/encoders/layers.0/self_attn/Div" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Div_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model/encoders/layers.0/self_attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/encoders/layers.0/self_attn/Softmax_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_3257" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2133112" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Transpose_2624" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="2134136" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model/encoders/layers.0/self_attn/wv/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model/encoders/layers.0/self_attn/wv/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/linear/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_183" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model/encoders/layers.0/self_attn/wv/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/norm/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_3258" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2396280" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/model/encoders/layers.0/self_attn/wv/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/norm/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_3259" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2397304" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/model/encoders/layers.0/self_attn/wv/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model/encoders/layers.0/self_attn/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2398328" size="32" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_5_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/model/encoders/layers.0/self_attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_2_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_198" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1072180" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model/encoders/layers.0/self_attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/model/encoders/layers.0/self_attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/MatMul_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_207" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1072180" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model/encoders/layers.0/self_attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_3_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model/encoders/layers.0/self_attn/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2398360" size="24" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_7_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model/encoders/layers.0/self_attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_3_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_3260" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2398384" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model/encoders/layers.0/self_attn/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2398360" size="24" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_8_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/model/encoders/layers.0/self_attn/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_4_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Transpose_2640" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="2399408" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model/encoders/layers.0/self_attn/pe/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/pe/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/model/encoders/layers.0/self_attn/pe/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/pe/linear/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_215" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/model/encoders/layers.0/self_attn/pe/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/pe/norm/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_3261" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2661552" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model/encoders/layers.0/self_attn/pe/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/pe/norm/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_3262" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2662576" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model/encoders/layers.0/self_attn/pe/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/pe/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model/encoders/layers.0/self_attn/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Transpose_2658" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="2663600" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model/encoders/layers.0/self_attn/out/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/out/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/model/encoders/layers.0/self_attn/out/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/out/linear/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_231" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model/encoders/layers.0/self_attn/out/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/out/norm/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_3264" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2925744" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/model/encoders/layers.0/self_attn/out/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/out/norm/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_3265" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2926768" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/model/encoders/layers.0/self_attn/out/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/out/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model/encoders/layers.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_245" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model/encoders/layers.0/norm1/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/norm1/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_3266" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2927792" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model/encoders/layers.0/norm1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/norm1/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_3267" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2928816" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/model/encoders/layers.0/norm1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/norm1/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_3271" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="2929840" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_3268" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="2930864" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Transpose_2685" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256" offset="2932912" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model/encoders/layers.0/ffn/linear1/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear1/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model/encoders/layers.0/ffn/linear1/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear1/linear/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_260" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/model/encoders/layers.0/ffn/linear1/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear1/norm/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_3269" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="3457200" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/model/encoders/layers.0/ffn/linear1/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear1/norm/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_3270" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="3459248" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/model/encoders/layers.0/ffn/linear1/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear1/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model/encoders/layers.0/ffn/linear1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/encoders/layers.0/ffn/linear1/act/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Transpose_2702" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="3461296" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model/encoders/layers.0/ffn/linear2/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear2/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/model/encoders/layers.0/ffn/linear2/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear2/linear/Add_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_277" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model/encoders/layers.0/ffn/linear2/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear2/norm/Div_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_3272" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="3985584" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/model/encoders/layers.0/ffn/linear2/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear2/norm/Mul_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_3273" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="3986608" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/model/encoders/layers.0/ffn/linear2/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/ffn/linear2/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/model/encoders/layers.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/Add_1_output_0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_291" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1063948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/model/encoders/layers.0/norm2/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>256</dim>
				</port>
